-- Insert data into challenge table
-- challengeID 인증 타입 → 1,2번(TEXT), 3번(PICTURE), 4번(GITHUB), 5번(LINK)
INSERT INTO `challenge` (`create_date`, `modified_date`, `description`, `is_free`, `title`, `verification_description`, `verification_type`)
VALUES
   ('2024-03-09 12:00:00', '2024-03-09 12:00:00', '백엔드 기술면접 챌린지 설명입니다.', 0, '백엔드 기술면접 챌린지', '글 인증으로 검증합니다.', 'TEXT'),
   ('2024-03-09 12:00:00', '2024-03-09 12:00:00',  '프론트엔드 아티클 공유 챌린지 설명입니다.', 0, '프론트엔드 아티클 공유 챌린지', '링크 인증으로 검증합니다.', 'LINK'),
   ('2024-03-09 12:00:00', '2024-03-09 12:00:00', '1일 1커밋 챌린지 설명입니다.', 1, '1일 1커밋 챌린지', '깃헙 인증으로 검증합니다.', 'GITHUB'),
   ('2024-03-09 12:00:00', '2024-03-09 12:00:00', '스크린타임 4시간 챌린지 설명입니다.', 1, '스크린타임 4시간 챌린지', '사진 인증으로 검증합니다.', 'PICTURE');



-- Insert test data for the challenge_group table
INSERT INTO `challenge_group` (`create_date`, `modified_date`, `participant_count`, `challenge_id`, `group_index`, `end_date`, `title`, `start_date`)
VALUES
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 9, 1, 1, '2024-03-10', '백엔드 기술면접 챌린지 1기', '2024-02-26'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 10, 1, 2, '2024-03-24', '백엔드 기술면접 챌린지 2기', '2024-03-11'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 23, 1, 3, '2024-04-07', '백엔드 기술면접 챌린지 3기', '2024-03-25'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 9, 2, 1, '2024-03-10', '프론트엔드 아티클 공유 챌린지 1기', '2024-02-26'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 10, 2, 2, '2024-03-24', '프론트엔드 아티클 공유 챌린지 2기', '2024-03-11'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 23, 2, 3, '2024-04-07', '프론트엔드 아티클 공유 챌린지 3기', '2024-03-25'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 15, 3, 1, '2024-03-10', '1일 1커밋 챌린지 1기', '2024-02-26'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 23, 3, 2, '2024-03-24', '1일 1커밋 챌린지 2기', '2024-03-11'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 11, 3, 3, '2024-04-07', '1일 1커밋 챌린지 3기', '2024-03-25'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 8, 4, 1, '2024-03-10', '스크린타임 4시간 챌린지 1기', '2024-02-26'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 10, 4, 2, '2024-03-24', '스크린타임 4시간 챌린지 2기', '2024-03-11'),
    ('2024-03-09 12:00:00', '2024-03-09 12:00:00', 29, 4, 3, '2024-04-07', '스크린타임 4시간 챌린지 3기', '2024-03-25');



-- Insert test data for the member table
INSERT INTO member (create_date, modified_date, auth_level, birth_year, email, gender, github_id, github_token, job_title, nickname)
VALUES
    (NOW(), NOW(), 'ADMIN', '1990', 'waved8888@gmail.com', 'MALE', null, null, null, '관리자 유진'),
    (NOW(), NOW(), 'ADMIN', '1985', 'waved7777@gmail.com', 'FEMALE', null, null, null, '관리자 채원'),
    (NOW(), NOW(), 'MEMBER', '1998', 'sdw504512@gmail.com', 'FEMALE', 'nampongo', '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', '프론트엔드', '유진닉네임'),
    (NOW(), NOW(), 'MEMBER', '2000', '0101angela57@gmail.com', 'MALE', 'chaewon-io', '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', '백엔드', '채원닉네임'),
    (NOW(), NOW(), 'MEMBER', '1901', 'test1@gmail.com', 'MALE', null, null, '풀 스택', '테스트1닉네임'),
    (NOW(), NOW(), 'MEMBER', '1902', 'test2@gmail.com', 'FEMALE', null, null, '안드로이드', '테스트2닉네임'),
    (NOW(), NOW(), 'MEMBER', '1903', 'test3@gmail.com', 'MALE', null, null, 'iOS', '테스트3닉네임'),
    (NOW(), NOW(), 'MEMBER', '1904', 'test4@gmail.com', 'FEMALE', null, null, '데브옵스', '테스트4닉네임'),
    (NOW(), NOW(), 'MEMBER', '1905', 'test5@gmail.com', 'MALE', null, null, '기타', '테스트5닉네임'),
    (NOW(), NOW(), 'MEMBER', '1906', 'test6@gmail.com', 'MALE', null, null, '풀 스택', '테스트6닉네임'),
    (NOW(), NOW(), 'MEMBER', '1907', 'test7@gmail.com', 'FEMALE', null, null, '안드로이드', '테스트7닉네임'),
    (NOW(), NOW(), 'MEMBER', '1908', 'test8@gmail.com', 'MALE', null, null, 'iOS', '테스트8닉네임'),
    (NOW(), NOW(), 'MEMBER', '1909', 'test9@gmail.com', 'FEMALE', null, null, '데브옵스', '테스트9닉네임'),
    (NOW(), NOW(), 'MEMBER', '1910', 'test10@gmail.com', 'MALE', null, null, '기타', '테스트10닉네임');

/*

-- Insert test data for the my_challenge table
INSERT INTO `my_challenge` (`create_date`, `modified_date`, `challenge_group_id`, `member_id`)
VALUES
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 3),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 2, 3),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 3, 3),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 7, 3),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 8, 3),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 9, 3),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 4),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 2, 4),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 3, 4),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 7, 4),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 8, 4),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 9, 4);
-- 채원(4) & 유진(3) 멤버 계정으로 챌린지 그룹 1, 2, 3, 7, 8, 9 삽입
-- 챌린지 (기술면접:백엔드/커밋)의 (완료/진행/대기) 챌린지가 마이 챌린지로 들어감


-- Insert test data for the my_challenge_my_verifs table
INSERT INTO `my_challenge_my_verifs` (`my_challenge_id`, `my_verifs`)
VALUES
    (2, 1),
    (2, 0),
    (2, 1),
    (2, 1),
    (2, 1),
    (7, 1),
    (7, 0),
    (7, 1),
    (7, 1),
    (7, 1);
-- 유진마이챌린지(1) & 채원마이챌린지(7)에 인증 현황 값 넣음

-- Insert test data for the quiz table
-- GET : api/v1/verify/{challengeGroupId} -> 2번 : 프론트 진행 퀴즈 / 5번 : 백엔드 진행 퀴즈
INSERT INTO `quiz` (`challenge_group_id`, `date`, `question`)
VALUES
    (2, '2024-03-11', '3월 11일 백엔드 퀴즈 문제'),
    (2, '2024-03-12', '3월 12일 백엔드 퀴즈 문제'),
    (2, '2024-03-13', '3월 13일 백엔드 퀴즈 문제'),
    (2, '2024-03-14', '3월 14일 백엔드 퀴즈 문제'),
    (2, '2024-03-15', '3월 15일 백엔드 퀴즈 문제'),
    (2, '2024-03-16', '3월 16일 백엔드 퀴즈 문제'),
    (2, '2024-03-17', '3월 17일 백엔드 퀴즈 문제'),
    (2, '2024-03-18', '3월 18일 백엔드 퀴즈 문제'),
    (2, '2024-03-19', '3월 19일 백엔드 퀴즈 문제'),
    (2, '2024-03-20', '3월 20일 백엔드 퀴즈 문제'),
    (2, '2024-03-21', '3월 21일 백엔드 퀴즈 문제'),
    (2, '2024-03-22', '3월 22일 백엔드 퀴즈 문제'),
    (2, '2024-03-23', '3월 23일 백엔드 퀴즈 문제'),
    (2, '2024-03-24', '3월 24일 백엔드 퀴즈 문제');


-- Insert test data for the review table
INSERT INTO `review` (`create_date`, `modified_date`, `challenge_id`, `challenge_group_id`, `content`, `member_id`)
VALUES
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1,  1, '기술 면접 챌린지를 통해 헷갈리던 내용을 정리해서 유익했어요~^^*', 3),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 3, 10, '커밋 챌린지 하면서 일을 미루지 않고 하게 돼서 좋았습니다.', 3),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '성공률 달성하지 못해서 돈은 못받았지만 유익했습니다.', 4),
    ('2022-01-02 00:00:00', '2022-01-02 00:00:00', 3, 10, '챌린지 너무 빡셈', 4),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰1 남겨요', 5),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰2 남겨요', 6),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰3 남겨요', 7),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰4 남겨요', 8),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰5 남겨요', 9),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰6 남겨요', 10),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰7 남겨요', 11),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰8 남겨요', 12),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰9 남겨요', 13),
    ('2022-01-01 00:00:00', '2022-01-01 00:00:00', 1, 1, '챌린지 리뷰10 남겨요', 14);
-- 채원(4) & 유진(3) 멤버 계정으로 내 리뷰 2개씩 조회
-- 챌린지 그룹 1로 리뷰 조회(총 6개) 테스트


-- Insert test data for the verification table
INSERT INTO `verification` (`create_date`, `modified_date`, `challenge_group_id`, `content`, `verification_type`, `member_id`)
VALUES
    ('2024-03-12 00:00:00', '2024-03-11 00:00:00', 1, '채원 백엔드 글 인증합니다.', 'TEXT', 4),
    ('2024-03-13 00:00:00', '2024-03-11 00:00:00', 4, '채원 사진 인증 URL', 'PICTURE', 4),
    ('2024-03-14 00:00:00', '2024-03-11 00:00:00', 3, 'true', 'GITHUB', 4),
    ('2024-03-15 00:00:00', '2024-03-11 00:00:00', 3, 'false', 'GITHUB', 4),
    ('2024-03-16 00:00:00', '2024-03-11 00:00:00', 2, '채원 프론트엔드 링크 인증합니다.', 'LINK', 4),

    ('2024-03-12 00:00:00', '2024-03-11 00:00:00', 1, '유진 백엔드 글 인증합니다.', 'TEXT', 3),
    ('2024-03-13 00:00:00', '2024-03-11 00:00:00', 4, '유진 사진 인증 URL', 'PICTURE', 3),
    ('2024-03-14 00:00:00', '2024-03-11 00:00:00', 3, 'true', 'GITHUB', 3),
    ('2024-03-15 00:00:00', '2024-03-11 00:00:00', 3, 'false', 'GITHUB', 3),
    ('2024-03-16 00:00:00', '2024-03-11 00:00:00', 2, '유진 프론트엔드 링크 인증합니다.', 'LINK', 3);
*/
